app/controllers/reservations_controller.rb

SELECT  "vacation_properties".* FROM "vacation_properties" WHERE "vacation_properties"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "reservations" ("name", "phone_number", "message", "vacation_property_id", "created_at", "updated_at", "status") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @vacation_property = VacationProperty.find(params[:reservation][:property_id])
    @reservation = @vacation_property.reservations.create(reservation_params)

SELECT  "users".* FROM "users" WHERE "users"."phone_number" = $1 LIMIT 1  [["phone_number", "+12066505813"]]
---
  def accept_or_reject
    incoming = params[:From]
    sms_input = params[:Body].downcase
    begin
      @host = User.find_by(phone_number: incoming)