app/controllers/users_controller.rb

  def create
    begin
      @user = User.create(user_params)
---
INSERT INTO "users" ("email", "password_digest", "name", "country_code", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"