app/controllers/vacation_properties_controller.rb

SELECT "vacation_properties".* FROM "vacation_properties"
---
  def index
    @vacation_properties = VacationProperty.all

INSERT INTO "vacation_properties" ("description", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Picard's Place"], ["image_url", "http://howtodocs.s3.amazonaws.com/trek_2.jpg"], ["created_at", "2015-06-24 21:44:36.809704"], ["updated_at", "2015-06-24 21:44:36.809704"]]
---
  def create
    @user = current_user
    @vacation_property = @user.vacation_properties.create(vacation_property_params)

SELECT  "vacation_properties".* FROM "vacation_properties" WHERE "vacation_properties"."id" = $1 LIMIT 1  [["id", 3]]
---
    def set_vacation_property_and_user
      @user = current_user
      @vacation_property = VacationProperty.find(params[:id])